Revit 2020 API
Field Methods
The Field type exposes the following members.
Methods
Name | Description
CompatibleDisplayUnitType
 Checks if the specified type is compatible with the field description.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SubEntityReadAccessGranted
 Checks whether there is read access to subentities storable in this field.
SubEntityWriteAccessGranted
 Checks whether there is write access to subentities storable in this field.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace